In [2]:
import pandas as pd
ss = pd.Series([4,7,-5,3])
ss.index = ['Bon','Steve','Jeff','Ryan']
print(ss['Bon'])

4

In [7]:
ss<40000

Bon      True
Steve    True
Jeff     True
Ryan     True
dtype: bool

In [9]:
ss[ss<4000]

Bon      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [10]:
'Bon' in ss

True

In [11]:
ss['Bon' in ss]

7

In [18]:
sdata = {'Ohio':35000,'Texas':70000}
ss = pd.Series(sdata)
ss2 = pd.Series(sdata)
print(ss + ss2)

Ohio      70000
Texas    140000
dtype: int64

In [17]:
ss3 = ss2
del(ss3['Ohio'])
ss2

Texas    70000
dtype: int64

In [20]:
ss2 = ss2.drop('Ohio')
ss2

Texas    70000
dtype: int64

In [23]:
df = pd.DataFrame([-4,7,-5,3],index=['d','b','a','c'])
print(df)

   0
d -4
b  7
a -5
c  3

In [22]:
df = pd.DataFrame([-4,7,-5,3],index=['d','b','a','c'],columns=['aa'])
print(df)

   aa
d  -4
b   7
a  -5
c   3

In [28]:
data ={'state':['Ohio','Ohio','Nevada','Nevada'],
      'year':[2000,2001,2000,2001],
      'pop':[1.5,1.7,2.4,2.9]}
df = pd.DataFrame(data,)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2  Nevada  2000  2.4
3  Nevada  2001  2.9

In [30]:
data ={'state':['Ohio','Ohio','Nevada','Nevada'],
      'year':[2000,2001,2000,2001],
      'pop':[1.5,1.7,2.4,2.9]}
df = pd.DataFrame(data,index=['one','twe','three','four'])
df

        state  year  pop
one      Ohio  2000  1.5
twe      Ohio  2001  1.7
three  Nevada  2000  2.4
four   Nevada  2001  2.9

In [32]:
data ={'state':['Ohio','Ohio','Nevada','Nevada'],
      'year':[2000,2001,2000,2001],
      'pop':[1.5,1.7,2.4,2.9]}
df2 = pd.DataFrame(data,index=['one','twe','three','four'],columns=['year','state','pop','debt'])
df2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
twe    2001    Ohio  1.7  NaN
three  2000  Nevada  2.4  NaN
four   2001  Nevada  2.9  NaN

In [35]:
df2.columns = ['year1','state2','pop2','debt2']
df2

       year1  state2  pop2 debt2
one     2000    Ohio   1.5   NaN
twe     2001    Ohio   1.7   NaN
three   2000  Nevada   2.4   NaN
four    2001  Nevada   2.9   NaN

In [39]:
df.loc['three']
print(type(df.loc['three']))

<class 'pandas.core.series.Series'>

In [51]:
import numpy as np
df2[year1[year1==2001]]

NameError: name 'year1' is not defined

In [55]:
df2['eastern'] = (df2.state2 == 'Ohio')
df2

       year1  state2  pop2  debt2  eastern
one     2000    Ohio   1.5      0     True
twe     2001    Ohio   1.7      1     True
three   2000  Nevada   2.4      2    False
four    2001  Nevada   2.9      3    False

In [59]:
df2['state2'] == 'Ohio'

one       True
twe       True
three    False
four     False
Name: state2, dtype: bool

In [64]:
df2.drop(['one'])

       year1  state2  pop2  debt2  eastern
twe     2001    Ohio   1.7      1     True
three   2000  Nevada   2.4      2    False
four    2001  Nevada   2.9      3    False

In [73]:
pop = {'Nevada':{2001:2.4,2002:2.9},'Ohio':{2001:1.5,2002:3.6}}
df3 = pd.DataFrame(pop)
df3

      Nevada  Ohio
2001     2.4   1.5
2002     2.9   3.6

In [71]:
pop = {'Nevada':{2001:2.4,2002:2.9},'Ohio':{2001:1.5,2002:3.6}}
df3 = pd.DataFrame(pop)
df3
df3.T

        2001  2002
Nevada   2.4   2.9
Ohio     1.5   3.6

In [74]:
df3 = pd.DataFrame(pop,index=[2001,2002,2003])
df3

      Nevada  Ohio
2001     2.4   1.5
2002     2.9   3.6
2003     NaN   NaN

In [79]:
ss

Ohio     35000
Texas    70000
dtype: int64

In [87]:
df3.index.nmae = 'state'
print(df3.index.name)

None

In [92]:
import numpy as np
df = pd.DataFrame(np.arange(12.).reshape((4,3)),
                  columns=['b','c','d'],index=['Utah','Ohio','Texas','Oregon'])
df

          b     c     d
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [99]:
ss

b    3.0
c    4.0
d    5.0
Name: Ohio, dtype: float64

In [100]:
ss[1]

4.0

In [102]:
ss.iloc[1]

4.0

In [104]:
print(ss.loc())

<pandas.core.indexing._LocIndexer object at 0x0000022A18EC0458>

In [98]:
ss = df.iloc[1]
print(df-ss)

          b    c    d
Utah   -3.0 -3.0 -3.0
Ohio    0.0  0.0  0.0
Texas   3.0  3.0  3.0
Oregon  6.0  6.0  6.0

In [107]:
df['b']

Utah      0.0
Ohio      3.0
Texas     6.0
Oregon    9.0
Name: b, dtype: float64

In [112]:
df.loc['Utah']

b    0.0
c    1.0
d    2.0
Name: Utah, dtype: float64

In [116]:
ss = pd.Series(range(4),index=['d','a','b','c'])
df = pd.DataFrame(np.arange(8).reshape((2,4)),
                 index=['three','one'],
                 columns=['d','a','b','c'])
ss
df

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [119]:
df.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [120]:
df.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [123]:
ss = pd.Series([7,-5,7,4,2,0,4])
print(ss.rank())

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [124]:
ss

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [126]:
ss = pd.Series([4,5,7,3],
              index=['d','b','a','c'])
ss

d    4
b    5
a    7
c    3
dtype: int64

In [127]:
ss2 = ss.reindex(['a','b','c','d'])
ss2

a    7
b    5
c    3
d    4
dtype: int64